lab8/requests/installments/unpaidForEvent.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:gs="pl/pwr/java/lab8/soap/installments">
    <soapenv:Header/>
    <soapenv:Body>
        <gs:fetchInstallmentsForEventRequest>
            <eventId>0</eventId>
            <page>0</page>
        </gs:fetchInstallmentsForEventRequest>
    </soapenv:Body>
</soapenv:Envelope>